# < Source - t.me/testingpluginnn >
# < https://github.com/TeamUltroid/Ultroid >

"""
✘ Flirt Slangs (bangla)

> CMD: `{i}samil`
"""

from random import choice
from asyncio import sleep
from . import *
from . import ultroid_cmd
lst = [
    "কিছু মানুষ আছে, যারা নির্দিষ্ট একটা মানুষের জন্য শতজনকেও উপেক্ষা করতে পারে!; 🥀",
    "পরিস্থিতি যেমনই হোক যে ভালোবাসে, সে কখনো ছেড়ে যায় না-!🖤🌻 ভালোবাসা মানেই অল্প 𝐒𝐚𝐜𝐫𝐢𝐟𝐢𝐜𝐞 আর অনেকটা 𝐂𝐚𝐫𝐞 করা!🙂🌺🌿.",
    "পৃথিবীর সবচেয়ে বা জে জিনিসের মধ্যে একটা হচ্ছে 'এক্সপেকটেশন', না চাইতেও আমরা ভুল মানুষের কাছে আবদার করে বসি,প্রায়োরিটি চাই,একটু কেয়ার চাই!🌸 ",
    "শাড়ি পড়লে মেয়েদের সবথেকে বেশি সুন্দর লাগে । আপনি কালো না ফর্সা, মোটা না চিকন, লম্বা না খাটো এসব কোন ব্যাপারই না! আপনি যেমনই হোন, শাড়ি আপনার সৌন্দর্য দশগুণ বাড়িয়ে দেয় । কুঁচি করতে পারেন না? ঐটাই সৌন্দর্য । এলোমেলো শাড়ি পড়েন ? ঐটাই সৌন্দর্য ।নারী মানেই শাড়ি, শাড়ি মানেই সৌন্দর্য!♡",
    "কারো ব্যক্তিত্বের প্রেমে পড়ার মতো বিপদজনক জিনিস খুব কম ই আছে। সুন্দর চেহারা একদিন,দুই দিন বা এক দুই মাস ভালো লাগে,এরপর আর না। অথচ কারো ব্যক্তিত্ব ভালো লেগে গেলে,সে মানুষ টা যা ই করুক,সেটাই ভাল্লাগে। তার সাথে একটু কথা বললেই ভাল্লাগে, তার কথা মন্ত্রমুগ্ধের মতো শুনতে ভাল্লাগে,সে মানুষ টা হাসলে ভাল্লাগে,তার চলাফেরা ভাল্লাগে। একটা অদ্ভুত টান কাজ করে তার প্রতি!🖤",
    "মানুষ যখন কারো 'প্রশংসা' করে, তখন খুব কম লোক তা বিশ্বাস করে🥀কিন্তু যখন কিনা তার 'বদনাম' করা হয়, তখন প্রায় সবাই তা বিশ্বাস করে🌸",
    "ভালোবাসার মানুষকে নিজের করে পেয়ে গেলে, মানুষের বেঁচে থাকার আনন্দ দ্বিগুণ বেড়ে যায়।🤍🌸.",
    "মানুষ আমি একটাই।তবে ব্যাক্তি ভাগে আমার চরিত্র গুলো আলাদা আলাদা। কারো কাছে আমি এক গম্ভীর মানুষ, কারো কাছে বদমেজাজি, কারো কাছে খুবই ফানি, কারো কাছে হয়তো খুব রোমান্টিক, অনেকর কাছে খুব ভদ্র এবং ভালো মানুষ। আবার কারো কাছে পৃথিবীর সবথেকে খারাপ মানুষটি আমি। তবে মানুষ কিন্তু আমি একটাই!",
    "আপনাকে নয় আপনার পজিশনকে মানুষ সম্মান করে। তাই পজিশন তৈরিতে কখনো আপোষ করবেন না!",
    "প্রিয় মানুষ ছেড়ে চলে যাবে! বেস্টফ্রেন্ড অন্য বেষ্টফ্রেন্ড বানাবে! ফ‍্য‍ামিলি প্র'বলেম বেড়ে যাবে! ডি'প্রেসড লাগবে! একাকিত্বে ডুবে যাবে! তবুও থেমে থাকা যাবে না!🖤জীবন সুন্দর!🌸",
    "যে সুখের আশায় ছেড়ে গিয়ে দুঃখ দিলে আমায়,দু-হাত তুলে প্রার্থনা করি সে সুখ যেন তোমাকে ছেড়ে না যায়🌸🖤",
    "যে গোপনে আসিয়াছিল, তাহাকে গোপনেই যাইতে  দিলাম। কিন্তু এই নির্জন নিশীথে সে যে তাহার কতোখানি আমার কাছে ফেলিয়া রাখিয়া গেল, তাহা কিছুই সে জানিতে পারিল না। 💙",
]
   

@ultroid_cmd(pattern="samil$")
async def bflirt(event):
    m = await event.eor("একটু শুনবা?.")
    await sleep(3)
    await m.edit(choice(lst))
